<template>
  <div :class="{ 'menu_is-open': isOpen }" class="menu">
    <div class="menu__btn" v-on:click="isOpen = !isOpen" data-cursor-type="medium">
      <span></span>
      <span></span>
    </div>
    <div class="menu__box">
      <div class="menu__content container">
        <div class="menu-nav">
          <div class="menu-item">
            <span class="menu-item__title" data-cursor-type="large">Разработка</span>
            <ul class="menu-item__links-list">
              <li><a class="menu-item__link" href="#" data-cursor-type="small">Корпоративные сайты</a></li>
              <li><a class="menu-item__link" href="#" data-cursor-type="small">Промо-магазины</a></li>
              <li><a class="menu-item__link" href="#" data-cursor-type="small">Промо-сайты</a></li>
            </ul>
            <div class="menu-divider menu-item__divider">
              <div class="menu-divider__line"></div>
            </div>
          </div>
          <div class="menu-item">
            <span class="menu-item__title" data-cursor-type="large">Контекстная реклама</span>
            <ul class="menu-item__links-list">
              <li><a class="menu-item__link" href="#" data-cursor-type="small">Контекстая реклама Google AdWords</a></li>
              <li><a class="menu-item__link" href="#" data-cursor-type="small">Контекстная реклама Яндекс Директ</a></li>
              <li><a class="menu-item__link" href="#" data-cursor-type="small">Колл-трекинг сайты</a></li>
            </ul>
            <div class="menu-divider menu-item__divider">
              <div class="menu-divider__line"></div>
            </div>
          </div>
          <div class="menu-item">
            <span class="menu-item__title" data-cursor-type="large">SEO продвижение</span>
            <ul class="menu-item__links-list">
              <li><a class="menu-item__link" href="#" data-cursor-type="small">Продвижение по позициям</a></li>
              <li><a class="menu-item__link" href="#" data-cursor-type="small">Продвижение в регионах</a></li>
              <li><a class="menu-item__link" href="#" data-cursor-type="small">Продвижение интернет-магазинов</a></li>
            </ul>
            <div class="menu-divider menu-item__divider">
              <div class="menu-divider__line"></div>
            </div>
          </div>
          <div class="menu-item">
            <span class="menu-item__title" data-cursor-type="large">Аналитика</span>
            <ul class="menu-item__links-list">
              <li><a class="menu-item__link" href="#" data-cursor-type="small">Анализ рынка и конкурентов</a></li>
              <li><a class="menu-item__link" href="#" data-cursor-type="small">Разработка бренд платформы</a></li>
              <li><a class="menu-item__link" href="#" data-cursor-type="small">Аналитика и сегментация</a></li>
            </ul>
            <div class="menu-divider menu-item__divider">
              <div class="menu-divider__line"></div>
            </div>
          </div>
          <div class="menu-item">
            <span class="menu-item__title" data-cursor-type="large">Сопровождение</span>
            <div class="menu-divider menu-item__divider">
              <div class="menu-divider__line"></div>
            </div>
          </div>
        </div>
        <div class="menu-footer">
          <div class="menu__contacts menu-footer__col">
            <div class="menu__socials menu-footer__row">
              <div class="menu__social-item">
                <svg width="27" height="15" viewBox="0 0 27 15" fill="none" xmlns="http://www.w3.org/2000/svg">
                  <path d="M23.9396 6.27118C24.3236 5.78789 24.6284 5.40011 24.8535 5.10755C26.4747 3.00874 27.1775 1.668 26.9621 1.08347L26.8776 0.946572C26.8215 0.864344 26.6759 0.788833 26.4418 0.720483C26.2075 0.652182 25.9076 0.641268 25.5423 0.686357L21.4937 0.714162C21.4 0.705075 21.3062 0.707198 21.2125 0.720483C21.1187 0.73436 21.0579 0.748287 21.0296 0.761572C21.0014 0.775499 20.9781 0.78666 20.9595 0.795747L20.9033 0.836836C20.8565 0.864048 20.805 0.912101 20.7488 0.980748C20.6925 1.04934 20.6454 1.12886 20.6081 1.22042C20.1677 2.32449 19.6664 3.35123 19.104 4.30028C18.7572 4.8661 18.4384 5.35695 18.1482 5.77159C17.8577 6.18718 17.614 6.49278 17.4172 6.6886C17.2204 6.88476 17.0422 7.0425 16.883 7.16073C16.7235 7.2798 16.6018 7.32968 16.5177 7.31155C16.4332 7.29343 16.3535 7.2753 16.2787 7.25654C16.1474 7.17465 16.0418 7.06309 15.9624 6.92135C15.8826 6.78026 15.8289 6.60217 15.8006 6.38759C15.7727 6.1733 15.7559 5.98835 15.7516 5.83298C15.7466 5.67796 15.7491 5.45913 15.7587 5.1759C15.7681 4.89297 15.7727 4.70169 15.7727 4.60104C15.7727 4.25465 15.7798 3.87808 15.7939 3.47188C15.8078 3.06598 15.8196 2.74408 15.8289 2.50678C15.8383 2.26982 15.8429 2.01865 15.8429 1.75389C15.8429 1.48972 15.8264 1.28176 15.7934 1.13098C15.7606 0.980747 15.7112 0.834762 15.646 0.693024C15.5802 0.551879 15.4843 0.442143 15.3576 0.364804C15.231 0.28712 15.0742 0.225782 14.8868 0.179804C14.3898 0.0700679 13.7572 0.0114464 12.989 0.00181609C11.2457 -0.015716 10.1258 0.0936745 9.62914 0.330629C9.43235 0.431278 9.25417 0.56788 9.09496 0.741373C8.92612 0.942375 8.90284 1.05206 9.02482 1.06959C9.58725 1.15182 9.98525 1.34828 10.2196 1.65837L10.304 1.82248C10.3695 1.94155 10.435 2.15135 10.5008 2.45235C10.5663 2.75341 10.6085 3.08647 10.6275 3.45158C10.6743 4.1177 10.6743 4.68777 10.6275 5.16261C10.5806 5.63741 10.5362 6.00677 10.494 6.27094C10.4518 6.5357 10.3885 6.74998 10.3043 6.91409C10.2199 7.07879 10.1637 7.17915 10.1355 7.21569C10.1072 7.25194 10.0839 7.27491 10.0653 7.28404C9.94335 7.32938 9.81701 7.35234 9.68575 7.35234C9.55443 7.35234 9.39517 7.28824 9.20771 7.16038C9.0202 7.03316 8.82559 6.85725 8.62444 6.63358C8.42267 6.41025 8.19575 6.09744 7.94246 5.69574C7.68947 5.29467 7.42684 4.81983 7.15524 4.27248L6.9305 3.87532C6.7899 3.62024 6.59773 3.24816 6.35407 2.76003C6.11041 2.2719 5.89465 1.79982 5.70749 1.34314C5.63238 1.15182 5.51998 1.00584 5.37011 0.905187L5.29996 0.864098C5.2531 0.827799 5.17798 0.788833 5.07492 0.747991C4.97155 0.706902 4.86418 0.67727 4.75148 0.658849L0.899667 0.686061C0.506082 0.686061 0.239144 0.773128 0.0985485 0.946572L0.042351 1.0285C0.0139479 1.07443 0 1.14757 0 1.24763C0 1.34828 0.0282509 1.4713 0.0844484 1.61699C0.64688 2.90394 1.25841 4.14496 1.91893 5.34001C2.57981 6.5357 3.15375 7.49863 3.64107 8.22855C4.12838 8.95907 4.62503 9.64756 5.13132 10.2956C5.6376 10.9436 5.9725 11.3585 6.13638 11.5408C6.30026 11.7237 6.42908 11.8606 6.52286 11.9515L6.87425 12.2803C7.09899 12.4992 7.42958 12.7615 7.86542 13.0674C8.3012 13.3732 8.7836 13.6743 9.31347 13.9705C9.84273 14.2673 10.4592 14.5088 11.1619 14.6962C11.8647 14.8836 12.5488 14.9588 13.2143 14.9219H14.8309C15.159 14.8947 15.4072 14.7947 15.5759 14.6209L15.632 14.5526C15.6693 14.4982 15.7047 14.4136 15.7375 14.2996C15.7701 14.1857 15.787 14.0599 15.787 13.9233C15.7773 13.531 15.8081 13.1768 15.8782 12.8624C15.9484 12.5475 16.0281 12.3106 16.1173 12.1504C16.2063 11.9911 16.3069 11.8563 16.4195 11.7466C16.5319 11.6368 16.6114 11.5713 16.6585 11.5483C16.7054 11.5259 16.743 11.5099 16.771 11.5002C16.9957 11.4273 17.2604 11.4981 17.5653 11.7124C17.8698 11.9273 18.1557 12.1914 18.4229 12.5064C18.6898 12.8213 19.0108 13.1746 19.3858 13.5672C19.7605 13.9595 20.0885 14.2515 20.3698 14.4431L20.651 14.6079C20.8384 14.7169 21.0818 14.8173 21.382 14.9089C21.6818 14.9999 21.9445 15.0228 22.1691 14.9772L25.768 14.9222C26.124 14.9222 26.4006 14.8654 26.5974 14.7511C26.7942 14.6378 26.9113 14.5115 26.9488 14.3748C26.9861 14.238 26.9885 14.0835 26.956 13.9097C26.9231 13.7365 26.8902 13.6156 26.8576 13.5473C26.8248 13.479 26.7942 13.4215 26.766 13.3762C26.2973 12.555 25.4024 11.5464 24.081 10.3511L24.0527 10.3239L24.0388 10.31L24.0248 10.2966H24.0107C23.4107 9.73991 23.0314 9.36572 22.8721 9.1738C22.5816 8.80933 22.5158 8.43968 22.6754 8.06553C22.7871 7.78181 23.2086 7.18399 23.9396 6.27118Z" fill="#F2EFE8"/>
                </svg>
              </div>
              <div class="menu__social-item">
                <svg width="17" height="17" viewBox="0 0 17 17" fill="none" xmlns="http://www.w3.org/2000/svg">
                  <path d="M2.18203 0H14.8181C16.0182 0 17 0.888444 17 2.18184V14.8182C17 16.1116 16.0182 17 14.8181 17H2.18203C0.981662 17 0 16.1116 0 14.8182V2.18184C0 0.888444 0.981662 0 2.18203 0ZM12.3839 1.88877C11.9629 1.88877 11.6188 2.23298 11.6188 2.65416V4.48603C11.6188 4.90704 11.9629 5.25142 12.3839 5.25142H14.3053C14.7263 5.25142 15.0707 4.90704 15.0707 4.48603V2.65416C15.0707 2.23298 14.7263 1.88877 14.3053 1.88877H12.3839ZM15.0787 7.18924H13.5825C13.7241 7.65144 13.8007 8.14104 13.8007 8.64758C13.8007 11.4752 11.4345 13.7674 8.51623 13.7674C5.59813 13.7674 3.23229 11.4752 3.23229 8.64758C3.23229 8.1407 3.30875 7.65127 3.45048 7.18924H1.88914V14.3703C1.88914 14.7419 2.1932 15.0461 2.56499 15.0461H14.4032C14.775 15.0461 15.0791 14.7421 15.0791 14.3703V7.18924H15.0787ZM8.51606 5.1549C6.63058 5.1549 5.10189 6.63593 5.10189 8.46308C5.10189 10.2902 6.63058 11.7713 8.51606 11.7713C10.4017 11.7713 11.9306 10.2902 11.9306 8.46308C11.9306 6.63593 10.4019 5.1549 8.51606 5.1549Z" fill="#F2EFE8"/>
                </svg>
              </div>
            </div>
            <div class="menu__mail menu-footer__row">
              mail@akticom.ru
            </div>
          </div>
          <div class="menu__phones menu-footer__col">
            <div class="menu__phone-item menu-footer__row">
              +7 (495) 409-32-16
            </div>
            <div class="menu__phone-item menu-footer__row">
              +7 (846) 313-23-20
            </div>
          </div>
          <div class="menu__address menu-footer__col">
            <div class="menu__city menu-footer__row">
              <div :class="{ 'menu__city_selected': address == 'Samara' }" v-on:click="address = 'Samara'" class="menu__city-item">
                Самара
              </div>
              <div class="menu-divider menu__city-divider">
                <div class="menu-divider__line"></div>
              </div>
              <div :class="{ 'menu__city_selected': address == 'Moscow' }" v-on:click="address = 'Moscow'" class="menu__city-item">
                Москва
              </div>
            </div>
            <div class="menu__address-item menu-footer__row">
              <span v-if="address == 'Samara'">ул. Ленинская, 168, офис 446</span>
              <span v-if="address == 'Moscow'">ул. Минская, 1 Г, к. 1, офис 9</span>
            </div>
          </div>
        </div>
      </div>
      <div class="menu__background">
        <div class="menu__underlay"></div>
      </div>
    </div>
  </div>
</template>

<script>
export default {
  data() {
    return {
      isOpen: false,
      address: 'Samara'
    }
  }
}
</script>